# PhyMaterialParamResistanceCalcStrength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamResistanceCalcStrength Property
ParameterTypeId Class See Also
---
"Resistance calculation strength"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamResistanceCalcStrength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamResistanceCalcStrength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamResistanceCalcStrength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace